In [60]:
import pandas as pd
import sqlite3


Using chinook.db write pandas code.
1. Customer Purchases Analysis:

- Find the total amount spent by each customer on purchases (considering invoices).
- Identify the top 5 customers with the highest total purchase amounts.
- Display the customer ID, name, and the total amount spent for the top 5 customers.

In [35]:
conn = sqlite3.connect('chinook.db')
cursor = conn.cursor()

tables = pd.read_sql_query("select name from sqlite_master WHERE type='table'",conn)
dfs={}
for i in tables['name']:
    dfs[i]=pd.read_sql_query(f'select * from {i}',conn)
# ['customers', 'sqlite_sequence', 'invoices', 'artists', 'albums', 'tracks', 'invoice_lines']

In [ ]:
# 1 - Find the total amount spent by each customer on purchases (considering invoices).

total_pur_customers = dfs['invoices'].groupby(['CustomerId'])['Total'].sum().reset_index()
total_pur_customers

   CustomerId  Total
0           1  38.49
1           2  48.75
2           3  10.00
3           4  45.00
4           5  20.00

In [58]:
#2 - Identify the top 5 customers with the highest total purchase amounts.
top5 = total_pur_customers.nlargest(5,'Total')
top5

   CustomerId  Total
1           2  48.75
3           4  45.00
0           1  38.49
4           5  20.00
2           3  10.00

In [59]:
#3 - Display the customer ID, name, and the total amount spent for the top 5 customers.
result = pd.merge(top5,dfs['customers'],how='inner',on='CustomerId')
result[['CustomerId','FirstName','Total']]

   CustomerId FirstName  Total
0           2      Jane  48.75
1           4       Bob  45.00
2           1      John  38.49
3           5   Charlie  20.00
4           3     Alice  10.00